# parameters
nc: 0 # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple

anchors: None

# yolov4s rec
backbone:
  # [from, number, module, args] args[channel, kernel, stride]
  [[-1, 1, Conv, [32, 3, 1]],  # 0
   [-1, 1, Conv, [64, 3, 2]],  # 1-P1/2
   [-1, 1, Bottleneck, [64]],
   [-1, 1, Conv, [128, 3, 2]],  # 3-P2/4
   [-1, 2, BottleneckCSP, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 5-P3/8
   [-1, 2, AEBottleneck, [[64, 32, 16]]], # /8 /16 /32 [/64] /32 /16 /8
   [-1, 2, AEHead, [[128, 64, 32]]] # /4 /2 /1
  ]

head: []